from django import forms


class IndividualIncidentsForm(forms.Form):
    limit_time_chooses = [
        ('3', "3 ماه"),
        ('6', "6 ماه"),
        ('9', "9 ماه"),
        ('1Y', "یک سال"),  # 1Y = یک سال
    ]
    job_category_chooses = [
        ('محصل ، دانشجو یا مدرس', "محصل ، دانشجو یا مدرس"),
        ('مشاغل اداری و دفتری مدیران و کارمندان دولتی و خصوصی', "مشاغل اداری و دفتری مدیران و کارمندان دولتی و خصوصی"),
        (' فروش و بازاریابی - فروشنده/ بازاریاب /صندوقدار', " فروش و بازاریابی - فروشنده/ بازاریاب /صندوقدار"),
        ('مشاغل خدماتی', " مشاغل خدماتی"),
        ('مشاغل درباره ابزار سبک و تعمیرات', "مشاغل درباره ابزار سبک و تعمیرات"),
        ('کاربامواد شمیایی و قابل اشتعال', "کاربامواد شمیایی و قابل اشتعال"),
        ('کارباابزار و ماشین آلات سنگین', "کارباابزار و ماشین آلات سنگین"),
        (' پزشکان و کادر درمان', " پزشکان و کادر درمان"),
        ('کاربا برق', "کاربا برق"),
        ('کار در ارتفاع', "کار در ارتفاع"),
        ('کاربا اصلحه', "کاربا اصلحه"),
        ('کاربا ماشین آلان صنعتی', "کاربا ماشین آلان صنعتی"),
        ('خبر نگاری - عکاسی و مشاغل مربوط به حوضه رسانه', "خبر نگاری - عکاسی و مشاغل مربوط به حوضه رسانه"),
        ('فعالین حوضه سینما تلوزیون تاتر', "فعالین حوضه سینما تلوزیون تاتر"),
        ('فعالین گردشگری داخلی و خارجی', "فعالین گردشگری داخلی و خارجی"),
        (' مسافرت خارجی', " مسافرت خارجی"),
        ('مسافرت خارجی', "مسافرت خارجی"),
        ('بدون شغل', "بدون شغل"),
        ('سایر', "سایر"),
    ]
    number_people = forms.IntegerField()
    limit_time = forms.ChoiceField(choices=limit_time_chooses)
    job_category = forms.ChoiceField(choices=job_category_chooses)
